Revit 2026 API

# DuctLossMethodType Enumeration

---

An enumerated type listing all duct loss calculation methods for a connector.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DuctLossMethodType
```
```vb
Public Enumeration DuctLossMethodType
```
```cpp
public enum class DuctLossMethodType
```
```fsharp
type DuctLossMethodType
```

| Member name | Value | Description |
| --- | --- | --- |
| Coefficient | 6 | Duct loss method depends on the loss coefficient. |
| NotDefined | 0 | Duct loss method is undefined. |
| SpecificLoss | 4 | Duct loss method is specified. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace